# Вероятность того, что стрелок попадет в мишень, выстрелив один раз, равна 0.8. Стрелок выстрелил 100 раз. Найдите вероятность того, 
# что стрелок попадет в цель ровно 85 раз.

from math import factorial



# функция по расчету сочетаний
def combinations (k, n):
    return factorial(n)/(factorial(k)*factorial(n-k))

# Для расчета вероятности воспользуемся формулой Бернули
k = 85
n = 100
p = 0.8
q = 1 - p
print(f'Вероятность стрелка попасть в мишень {k} раз = {round(combinations(k,n) * p ** k * q ** (n-k) * 100, 2)} %')